src/DataProcessors/НастройкаПараметровУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>НастройкаПараметровУчета</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/УчетныеПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УчетныеПолитики</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.УчетныеПолитики</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.УчетныеПолитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/НастройкаПараметровУчета/Forms/НастройкаУчетнойПолитики/Ext/Form/Module.bsl
// Модуль основной формы обработки "Настройки параметров учета"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Продолжение обработчика события нажатия кнопки "Выбор назначения".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПродолжитьВыборНазначения(Команда)
	
	// Получаем новое выбранное назначение учетной политики.
	ТекНомерНазначения = Число(СтрЗаменить(Команда.Имя, "ВыборНазначения", ""));
	ТекНазначение      = НомераНазначений.НайтиПоЗначению(ТекНомерНазначения).Представление;
	
	// Активируем соотв. поле ввода и устанавливаем заголовок группы.
	Элементы.ГруппаВыбораНазначенияУП.Заголовок = Элементы["Назначение" + ТекНомерНазначения].Заголовок;
	
	// Перебираем остальные виды назначений.
	Для Сч = 1 По СтрЧислоСтрок(ВидыНазначений) Цикл
		
		ТекСтрокаНазначение = СтрПолучитьСтроку(ВидыНазначений, Сч);
		ЭтоВыбранныйЭлемент = ТекСтрокаНазначение = ТекНазначение;
		
		ТекНомерНазначения         = НомераНазначений.НайтиПоЗначению(Сч);
		ТекНомерНазначения.Пометка = ЭтоВыбранныйЭлемент;
		
		// Отключаем ненужные поля ввода.
		Элементы["Тек" + ТекСтрокаНазначение].Видимость = ЭтоВыбранныйЭлемент;
		Элементы["Назначение" + Сч].Пометка             = ЭтоВыбранныйЭлемент;
		
	КонецЦикла;
	
	ОбъектНастройки = Неопределено;
	ОбъектПриИзменении(Команда);
	
КонецПроцедуры //ПродолжитьВыборНазначения()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаОтветаНаВопрос(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ВыборНазначения") Тогда
		
		Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			Модифицированность = Ложь;
			ПродолжитьВыборНазначения(ДополнительныеПараметры.ВыборНазначения);
		ИначеЕсли РезультатОповещения = КодВозвратаДиалога.Да Тогда
			Записать(Неопределено);
			ПродолжитьВыборНазначения(ДополнительныеПараметры.ВыборНазначения);
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры = "ОбъектПриИзменении" Тогда
		
		Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			Модифицированность = Ложь;
			ПродолжитьОбъектПриИзменении();
		ИначеЕсли РезультатОповещения = КодВозвратаДиалога.Да Тогда
			Записать(Неопределено);
			ПродолжитьОбъектПриИзменении();
		ИначеЕсли РезультатОповещения = КодВозвратаДиалога.Отмена Тогда
			ЭтотОбъект["Тек" + ТекНазначение] = ЭтотОбъект["Уст" + ТекНазначение];;
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры = "ДатаПриИзменении" Тогда
		
		Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			Модифицированность = Ложь;
			Дата = НачалоДня(Дата);
			УстДата = Дата;
			ЗаполнитьУчетныеПолитики();
		ИначеЕсли РезультатОповещения = КодВозвратаДиалога.Да Тогда
			Записать(Неопределено);
			Дата = НачалоДня(Дата);
			УстДата = Дата;
			ЗаполнитьУчетныеПолитики();
		ИначеЕсли РезультатОповещения = КодВозвратаДиалога.Отмена Тогда
			Дата = УстДата;
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры = "ВыборДаты" И НЕ РезультатОповещения = Неопределено Тогда
		
		// Добавим выбранную дату в список и установим ее текущей
		Дата = РезультатОповещения;
		НайденнаяДата = СписокДат.НайтиПоЗначению(Дата);
		Если НайденнаяДата = Неопределено Тогда
			НоваяДатаУчетныеПолитики = СписокДат.Добавить();
			НоваяДатаУчетныеПолитики.Значение = Дата;
			СписокДат.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
			Элементы.СписокДат.ТекущаяСтрока = НоваяДатаУчетныеПолитики.ПолучитьИдентификатор();
		Иначе
			Элементы.СписокДат.ТекущаяСтрока = НайденнаяДата.ПолучитьИдентификатор();
		КонецЕсли;
		УстДата = Дата;
		ЗаполнитьУчетныеПолитики();
		
	ИначеЕсли ДополнительныеПараметры = "УдалитьДату" Тогда
		
		Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
			УдалитьУчетныеПолитики(Элементы.СписокДат.ТекущиеДанные.Значение);
			СписокДат.Удалить(СписокДат.НайтиПоЗначению(Элементы.СписокДат.ТекущиеДанные.Значение));
			Элементы.СписокДат.ТекущаяСтрока = СписокДат.НайтиПоЗначению(Дата("39991231")-1).ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_СписокДатПриАктивизацииСтроки()
	
	// Если форма была изменена, зададим вопрос пользователю.
	Если Модифицированность Тогда
		
		// Формируем описание обработчика перехвата закрытия формы.
		ОбработчикВопроса = Новый ОписаниеОповещения("Подключаемый_ОбработкаОтветаНаВопрос", ЭтотОбъект,"ДатаПриИзменении");
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Настройки были изменены. Сохранить?'");
		
		// Получаем подтверждение операции от пользователя.
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	ИначеЕсли Элементы.СписокДат.ТекущиеДанные.Представление = "ВЫБРАТЬ дату" Тогда
		
		// Формируем описание обработчика перехвата закрытия формы.
		ОбработчикВопроса = Новый ОписаниеОповещения("Подключаемый_ОбработкаОтветаНаВопрос", ЭтотОбъект,"ВыборДаты");
		ПоказатьВводДаты(ОбработчикВопроса,Дата,, ЧастиДаты.Дата);
		
	ИначеЕсли Элементы.СписокДат.ТекущиеДанные.Представление = НСтр("ru = 'Текущая дата'") Тогда
		
		Дата = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
		УстДата = Дата;
		
		ЗаполнитьУчетныеПолитики();
		
	ИначеЕсли НЕ Элементы.СписокДат.ТекущиеДанные = Неопределено 
		И НЕ Дата = НачалоДня(Элементы.СписокДат.ТекущиеДанные.Значение) Тогда
		
		Дата = НачалоДня(Элементы.СписокДат.ТекущиеДанные.Значение);
		УстДата = Дата;
		ЗаполнитьУчетныеПолитики();
		
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("УчетныеПолитики");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчетныеПолитики.Изменено");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	// Цвет текста, доступность
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("УчетныеПолитикиПараметр");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("УчетныеПолитикиЗначение");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчетныеПолитики.Заблокирован");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста",  ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
КонецПроцедуры

// Заполняет таблицу учетных политик. Вызов процедуры производить после установки нулевого значения в НомераНазначений.
&НаСервере
Процедура ЗаполнитьУчетныеПолитики()
	
	УчетныеПолитики.Очистить();
	
	РедактированиеНедоступно = НЕ (ЗначениеЗаполнено(ОбъектНастройки) ИЛИ ТекНазначение = "Компания");
	Элементы.УчетныеПолитики.ТолькоПросмотр = РедактированиеНедоступно;
	
	ОписанияНастроек = ПолучитьОписанияНастроек();
	
	// получим список учетных политик, доступные для текущего объекта
	СтруктураОтборов = Новый Структура(ТекНазначение, Истина);
	НайденныеСтроки = НазначениеУчетныхПолитик.НайтиСтроки(СтруктураОтборов);
	
	МассивУчетныхПолитик = Новый Массив;
	Для Каждого СтрокаУчетнаяПолитика Из НайденныеСтроки Цикл
		МассивУчетныхПолитик.Добавить(СтрокаУчетнаяПолитика.Параметр);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПВХУчетныеПолитики.Ссылка КАК Параметр,
	|	ЕСТЬNULL(УчетныеПолитикиСрезПоследних.Значение, ЕСТЬNULL(ПВХУчетныеПолитики.ЗначениеПоУмолчанию, """")) КАК Значение,
	|	ПВХУчетныеПолитики.Код
	|ИЗ
	|	ПланВидовХарактеристик.УчетныеПолитики КАК ПВХУчетныеПолитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеПолитики.СрезПоследних(&Дата, Объект = &Объект) КАК УчетныеПолитикиСрезПоследних
	|		ПО (УчетныеПолитикиСрезПоследних.Параметр = ПВХУчетныеПолитики.Ссылка)
	|ГДЕ
	|	ПВХУчетныеПолитики.Ссылка В(&ОтборНастроек)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПВХУчетныеПолитики.Код";
	
	Запрос.УстановитьПараметр("Дата",          НачалоДня(Дата));
	Запрос.УстановитьПараметр("Объект",        ОбъектНастройки);
	Запрос.УстановитьПараметр("ОтборНастроек", МассивУчетныхПолитик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Код) Тогда
			КодНастройки = Число(Выборка.Код);
		Иначе
			КодНастройки = 0;
		КонецЕсли;
		
		НоваяСтрокаУчетныеПолитики = УчетныеПолитики.Добавить();
		НоваяСтрокаУчетныеПолитики.Параметр = Выборка.Параметр;
		НоваяСтрокаУчетныеПолитики.Значение = Выборка.Параметр.ТипЗначения.ПривестиЗначение(Выборка.Значение);
		НоваяСтрокаУчетныеПолитики.Описание = ОписанияНастроек.Получить(КодНастройки);
		Если НЕ ЕстьЗаказы И (Выборка.Параметр = ПланыВидовХарактеристик.УчетныеПолитики.ЗакрыватьНераспределенныеЗаказыПокупателей ИЛИ Выборка.Параметр = ПланыВидовХарактеристик.УчетныеПолитики.ЗакрытиеЗаказовПоПодразделению) Тогда
			НоваяСтрокаУчетныеПолитики.Заблокирован = Истина;
		КонецЕсли;
		
		Если НЕ ЕстьКомиссия И Выборка.Параметр = ПланыВидовХарактеристик.УчетныеПолитики.СтратегияСписанияПартийТоваровПоСтатусам Тогда
			НоваяСтрокаУчетныеПолитики.Заблокирован = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьУчетныеПолитики()

// Заполняет таблицу дат изменения учетных политик.
&НаСервере
Процедура ЗаполнитьДатыУчетныеПолитики()
	
	СписокДат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеПолитики.Период КАК Период
	|ИЗ
	|	РегистрСведений.УчетныеПолитики КАК УчетныеПолитики
	|ГДЕ
	|	УчетныеПолитики.Объект = &Объект
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетныеПолитики.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Если ОбъектНастройки = "" Тогда
		ОбъектНастройки = Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Объект",        ОбъектНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Добавим текущую дату
	НоваяДатаУчетныеПолитики = СписокДат.Добавить();
	НоваяДатаУчетныеПолитики.Значение = Дата("39991231")-1;
	НоваяДатаУчетныеПолитики.Представление = НСтр("ru = 'Текущая дата'");
	Элементы.СписокДат.ТекущаяСтрока = НоваяДатаУчетныеПолитики.ПолучитьИдентификатор();
	Дата = ТекущаяДатаСеанса();
	
	// Добавим возможность добавления новой записи за любое число.
	НоваяДатаУчетныеПолитики = СписокДат.Добавить();
	НоваяДатаУчетныеПолитики.Значение = Дата("39991231")-2;
	НоваяДатаУчетныеПолитики.Представление = "ВЫБРАТЬ дату";
	
	Пока Выборка.Следующий() Цикл
		
		НоваяДатаУчетныеПолитики = СписокДат.Добавить();
		НоваяДатаУчетныеПолитики.Значение = Выборка.Период;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДатыУчетныеПолитики()

// Удаляет значение учетных политик на выбранную дату
&НаСервере
Процедура УдалитьУчетныеПолитики(УдаляемаяДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеПолитики.Период КАК Период,
	|	УчетныеПолитики.Объект КАК Объект,
	|	УчетныеПолитики.Параметр КАК Параметр,
	|	УчетныеПолитики.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.УчетныеПолитики КАК УчетныеПолитики
	|ГДЕ
	|	УчетныеПолитики.Объект = &Объект
	|	И УчетныеПолитики.Период = &Дата";
	
	Запрос.УстановитьПараметр("Дата",   УдаляемаяДата);
	Запрос.УстановитьПараметр("Объект", ОбъектНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаРегистра = РегистрыСведений.УчетныеПолитики.СоздатьМенеджерЗаписи();
		СтрокаРегистра.Период = Выборка.Период;
		СтрокаРегистра.Объект = Выборка.Объект;
		СтрокаРегистра.Параметр = Выборка.Параметр;
		СтрокаРегистра.Значение = Выборка.Значение;
		СтрокаРегистра.Прочитать();
		СтрокаРегистра.Удалить();
	КонецЦикла;
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	ЗаполнитьУчетныеПолитики();
	
КонецПроцедуры // УдалитьУчетныеПолитики()

// Процедура выполняет запись значений настроек в регистр сведений.
//
&НаСервере
Процедура СохранитьНастройки()
	
	// Запишем расширение прав доступа (только измененные строки)
	УчетнаяПолитикаИзменена = (УчетныеПолитики.НайтиСтроки(Новый Структура("Изменено", Истина)).Количество()>0);
	Для Каждого СтрокаУчетнаяПолитика Из УчетныеПолитики.НайтиСтроки(Новый Структура("Изменено", Истина)) Цикл
		
		РСУчетныеПолитики = РегистрыСведений.УчетныеПолитики.СоздатьМенеджерЗаписи();
		РСУчетныеПолитики.Период = НачалоДня(Дата);
		РСУчетныеПолитики.Объект = ОбъектНастройки;
		ЗаполнитьЗначенияСвойств(РСУчетныеПолитики, СтрокаУчетнаяПолитика);
		
		Попытка
			РСУчетныеПолитики.Записать();
			ОбновитьУчетнуюПолитикуВКэше(РСУчетныеПолитики.Параметр, РСУчетныеПолитики.Значение, РСУчетныеПолитики.Объект, Дата);
			// все равно придется сбрасывать кэш, т.к. он идет "по датам"
			ОбновитьПовторноИспользуемыеЗначения();
			СтрокаУчетнаяПолитика.Изменено = Ложь;
			Модифицированность = Ложь;
		Исключение
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // СохранитьНастройки()

// Заполняет соответствие описаний настроек из макета "НастройкиПоУмолчанию"
&НаСервере
Функция ПолучитьОписанияНастроек()
	
	ОписанияНастроек = Новый Соответствие;
	
	Макет = ПланыВидовХарактеристик.УчетныеПолитики.ПолучитьМакет("УчетныеПолитикиПоУмолчанию");
	
	Для Номер = 1 По Макет.ВысотаТаблицы Цикл
		
		// Получаем код настройки
		Код = СокрЛП(Макет.ПолучитьОбласть("R" + Строка(Номер) + "C7").ТекущаяОбласть.Текст);
		
		// Дошли до конца макета, выходим из цикла
		Если НЕ ЗначениеЗаполнено(Код) Тогда
			Прервать;
		КонецЕсли;
		
		// Пробуем получить HTML-описание настройки
		Описание = СокрЛП(Макет.ПолучитьОбласть("R" + Строка(Номер) + "C10").ТекущаяОбласть.Текст);
		
		// HTML-описание отсутствует, получаем обычное описание
		Если НЕ ЗначениеЗаполнено(Описание) Тогда
			Описание = СокрЛП(Макет.ПолучитьОбласть("R" + Строка(Номер) + "C9").ТекущаяОбласть.Текст);
		КонецЕсли;
		
		// Если получили описание, добавляем его в соответствие
		Если ЗначениеЗаполнено(Описание) Тогда
			ОписанияНастроек.Вставить(Число(Код), Описание);
		КонецЕсли;
		
		// заполним таблицу назначений учетных политик
		НазваниеУчетнойПолитики = СокрЛП(Макет.ПолучитьОбласть("R" + Строка(Номер) + "C2").ТекущаяОбласть.Текст);
		УчетнаяПолитика = ПланыВидовХарактеристик.УчетныеПолитики.НайтиПоНаименованию(НазваниеУчетнойПолитики);
		Если ЗначениеЗаполнено(УчетнаяПолитика) Тогда
			// получим сразу ссылку
			НоваяСтрока               = НазначениеУчетныхПолитик.Добавить();
			НоваяСтрока.Параметр      = УчетнаяПолитика;
			НоваяСтрока.Компания      = ЗначениеЗаполнено(СокрЛП(Макет.ПолучитьОбласть("R" + Строка(Номер) + "C3").ТекущаяОбласть.Текст));
			НоваяСтрока.Организация   = ЗначениеЗаполнено(СокрЛП(Макет.ПолучитьОбласть("R" + Строка(Номер) + "C4").ТекущаяОбласть.Текст));
			НоваяСтрока.Подразделение = ЗначениеЗаполнено(СокрЛП(Макет.ПолучитьОбласть("R" + Строка(Номер) + "C5").ТекущаяОбласть.Текст));
			НоваяСтрока.Склад         = ЗначениеЗаполнено(СокрЛП(Макет.ПолучитьОбласть("R" + Строка(Номер) + "C6").ТекущаяОбласть.Текст));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписанияНастроек;
	
КонецФункции // ПолучитьСтруктуруОписаний()



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Выбор назначения".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ВыборНазначения(Команда)
	
	// Если форма была изменена, зададим вопрос пользователю
	Если Модифицированность Тогда
		
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВопроса = Новый ОписаниеОповещения("Подключаемый_ОбработкаОтветаНаВопрос", ЭтотОбъект,Новый Структура("ВыборНазначения",Команда));
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Настройки были изменены. Сохранить?'");
		
		// Получаем подтверждение операции от пользователя
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		
		ПродолжитьВыборНазначения(Команда);
		
	КонецЕсли;
	
КонецПроцедуры //ВыборНазначения()

// Обработчик события нажатия кнопки "Удалить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура УдалитьДату(Команда)
	
	Если Элементы.СписокДат.ТекущиеДанные.Представление = "ВЫБРАТЬ дату" 
		ИЛИ Элементы.СписокДат.ТекущиеДанные.Представление = НСтр("ru = 'Текущая дата'") Тогда
		
		ВывестиСообщение(НСтр("ru='Выбранное значение даты удалить нельзя.'"));
		
	Иначе
		
		// Формируем описание обработчика перехвата закрытия формы.
		ОбработчикВопроса = Новый ОписаниеОповещения("Подключаемый_ОбработкаОтветаНаВопрос", ЭтотОбъект,"УдалитьДату");
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Настройка учетной политики на выбранную дату будет удалена. Продолжить?'");
		
		// Получаем подтверждение операции от пользователя.
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры //УдалитьДату()

// Обработчик события нажатия кнопки "Записать".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНастройки();
	
	ТекДата = Дата;
	ЗаполнитьДатыУчетныеПолитики();
	ЗаполнитьУчетныеПолитики();
	НайденнаяСтрока = СписокДат.НайтиПоЗначению(ТекДата);
	Если НайденнаяСтрока <> Неопределено Тогда
		Дата = ТекДата;
		Элементы.СписокДат.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	УстДата = Дата;

	Оповестить("ОбновитьУчетнуюПолитику");
	
КонецПроцедуры  // Записать()

// Обработчик события нажатия кнопки "Записать и закрыть".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Записать(Неопределено);
	Закрыть();
	
КонецПроцедуры // ЗаписатьИЗакрыть()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Объект".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	// Если форма была изменена, зададим вопрос пользователю
	Если Модифицированность Тогда
		
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВопроса = Новый ОписаниеОповещения("Подключаемый_ОбработкаОтветаНаВопрос", ЭтотОбъект, "ОбъектПриИзменении");
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Настройки были изменены. Сохранить?'");
		
		// Получаем подтверждение операции от пользователя
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		
		ПродолжитьОбъектПриИзменении();
		
	КонецЕсли;
	
КонецПроцедуры //ОбъектПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Объект".
//
&НаКлиенте
Процедура ПродолжитьОбъектПриИзменении()
	
	// Устанавливаем в реквизит значение из соотв. поля ввода.
	ОбъектНастройки = ЭтотОбъект["Тек" + ТекНазначение];
	
	ЭтотОбъект["Уст" + ТекНазначение] = ОбъектНастройки;
	
	ЗаполнитьДатыУчетныеПолитики();
	УстДата = Дата;
	
	ЗаполнитьУчетныеПолитики();
	
КонецПроцедуры //ПродолжитьОбъектПриИзменении()

// Обработчик события вызывается при активизации строки таблице "Учетные политики".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура УчетныеПолитикиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.УчетныеПолитики.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОписаниеНастройки = "<html><head></head><body>" + ТекущиеДанные.Описание + "</body></html>";
	КонецЕсли;
	
КонецПроцедуры //УчетныеПолитикиПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Значения" в таблице "Учетные политики".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура УчетныеПолитикиЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УчетныеПолитики.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.Изменено = Истина;
		Модифицированность     = Истина;
	КонецЕсли;
	
КонецПроцедуры //УчетныеПолитикиЗначениеПриИзменении()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокДатПриАктивизацииСтроки(Элемент)
	
	Если ТекСтрокаСписка = Элемент.ТекущаяСтрока Тогда
		Возврат;
	Иначе
		ТекСтрокаСписка= Элемент.ТекущаяСтрока;
	КонецЕсли;
	
	// Производим подключение обработчика события выполняемого с задержкой
	ЭтотОбъект.ПодключитьОбработчикОжидания("Подключаемый_СписокДатПриАктивизацииСтроки", 0.5, ИСТИНА);
	
КонецПроцедуры

// Обработчик события возникает при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Учетные политики".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока- Значение выбранной строки.
//  Поле - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак 
//  									выполнения стандартной (системной) обработки события.
&НаКлиенте
Процедура СписокДатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.СписокДат.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено
		И ТекСтрока.Представление = "ВЫБРАТЬ дату" Тогда
		Подключаемый_СписокДатПриАктивизацииСтроки();
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ЕстьЗаказы = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказы");
	ЕстьКомиссия = ПолучитьФункциональнуюОпцию("ИспользоватьКомиссионнаяТорговля");
	
	Если Параметры.Свойство("ОбъектНастройки") Тогда
		ОбъектНастройки = Параметры.ОбъектНастройки;
	КонецЕсли;
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	
	// В зависимости от типа объекта выбираем соотв. вид назначения.
	ТипНастройки  = ТипЗнч(ОбъектНастройки);
	ТекНазначение = ?(ТипНастройки = Тип("СправочникСсылка.Организации"),           "Организация",
	                ?(ТипНастройки = Тип("СправочникСсылка.ПодразделенияКомпании"), "Подразделение", 
	                ?(ТипНастройки = Тип("СправочникСсылка.СкладыКомпании"),        "Склад", "Компания")));
	
	// Формируем перечень назначений учетных политик, его не меняем, работаем с копией.
	ВидыНазначений    = "Компания" + Символы.ПС + "Организация" + Символы.ПС + "Подразделение" + Символы.ПС + "Склад";
	
	// Устанавливаем заголовок группы.
	Для каждого КнопкаВыбора Из Элементы.ГруппаВыбораНазначенияУП.ПодчиненныеЭлементы Цикл
		Если СтрНайти(КнопкаВыбора.Заголовок, ТекНазначение) > 0 Тогда
			Элементы.ГруппаВыбораНазначенияУП.Заголовок = КнопкаВыбора.Заголовок;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Добавляем в список номеров остальные виды назначений.
	Для Сч = 1 По СтрЧислоСтрок(ВидыНазначений) Цикл
		
		// Добавляем назначения в список номеров.
		ТекСтрокаНазначение = СтрПолучитьСтроку(ВидыНазначений, Сч);
		ЭтоВыбранныйЭлемент = ТекСтрокаНазначение = ТекНазначение;
		
		НовыйНомерНазначения         = НомераНазначений.Добавить(Сч, ТекСтрокаНазначение);
		НовыйНомерНазначения.Пометка = ЭтоВыбранныйЭлемент;
		
		// Отключаем ненужные поля ввода.
		Элементы["Тек" + ТекСтрокаНазначение].Видимость = ЭтоВыбранныйЭлемент;
		Элементы["Назначение" + Сч].Пометка             = ЭтоВыбранныйЭлемент;
	КонецЦикла;
	
	// Устанавливаем в соотв. поле ввода значение объекта.
	ЭтотОбъект["Тек" + ТекНазначение] = ОбъектНастройки;
	
	ЗаполнитьДатыУчетныеПолитики();
	ЗаполнитьУчетныеПолитики();
	
	ПрошлаяОрганизация = ТекОрганизация;
	УстДата = Дата;
	
	// В режиме веб-клиента произведем показ кнопки изменения текущего объекта
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Элементы.Изменить.Видимость = Истина;
		Элементы.ГруппаКнопки.Видимость = Истина;
		Элементы.УчетныеПолитикиКонтекстноеМенюИзменить.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()
